# DesignToFabricationConverter Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
DesignToFabricationConverter Constructor
DesignToFabricationConverter Class See Also
---
Creates a new instance of the DesignToFabricationConverter class.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public DesignToFabricationConverter(
	Document document
)
```

Visual Basic
---
```text
Public Sub New ( _
	document As Document _
)
```

Visual C++
---
```text
public:
DesignToFabricationConverter(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document A document in which to convert MEP design elements into fabrication parts.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DesignToFabricationConverter Class
Autodesk.Revit.DB.Fabrication Namespace